#include <stdio.h>

char* piece_b = { "▒Nдhдh╢H╢Hиоио░и░ие]е]иЄиЄиЄиЄиЄ" };
char* piece_r = { "л╙еKеKм█м█┌╧┌╧╪X╪Xм╢м╢зLзLзLзLзL" };

char* board_default[25] = {
	"∙▌∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙▀\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@░_∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°б@б@┌╧вw╪Xвwм█вwеKвwл╙вwеKвwм█вw╪Xвw┌╧б@дт∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@╡L∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwм╢вwвqвwвqвwвqвwвqвwвqвwм╢вwвtб@ом∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@зLвwвqвwзLвwвqвwзLвwвqвwзLвwвqвwзLб@дj∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╞[б@вuвwвrвwвrвwвrвwвrвwвrвwвrвwвrвwвtб@дV∙°\n",
	"∙°б@б@вxб@б@╖бб@кeб@б@б@б@б@║~б@м╔б@б@вxб@б@∙°\n",
	"∙°┤╤б@вuвwвsвwвsвwвsвwвsвwвsвwвsвwвsвwвtб@д╥∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°дгб@иЄвwвqвwиЄвwвqвwиЄвwвqвwиЄвwвqвwиЄб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╗yб@вuвwе]вwвqвwвqвwвqвwвqвwвqвwе]вwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°пuб@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°зgб@иовw░ивw╢Hвwдhвw▒Nвwдhвw╢Hвw░ивwиоб@б@∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°дlб@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙у∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙х\n",

};


char* piece_default[25] = {
	"∙▌∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙▀\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@░_∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°б@б@вzвwвwвwвwвwвwвwвwвwвwвwвwвwвwвwв{б@дт∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@╡L∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвw∙свwвqвwвqвwвqвwвqвwвqвwм╢вwвtб@ом∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@зLвwвqвwзLвwвqвwзLвwвqвwзLвwвqвwзLб@дj∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╞[б@вuвwвrвwвrвwвrвwвrвwвrвwвrвwвrвwвtб@дV∙°\n",
	"∙°б@б@вxб@б@╖бб@кeб@б@б@б@б@║~б@м╔б@б@вxб@б@∙°\n",
	"∙°┤╤б@вuвwвsвwвsвwвsвwвsвwвsвwвsвwвsвwвtб@д╥∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°дгб@иЄвwвqвwиЄвwвqвwиЄвwвqвwиЄвwвqвwиЄб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╗yб@вuвwе]вwвqвwвqвwвqвwвqвwвqвwе]вwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°пuб@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°зgб@иовw░ивw╢Hвwдhвw▒Nвwдhвw╢Hвw░ивwиоб@б@∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°дlб@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙у∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙х\n",

};
