#include <stdio.h>
#define offset_x 3
#define offset_y 3

			   //впв░в▒в▓в│в┤в╡в╢в╖в╕10б@12  14  16  18  20  22  24  26  28  30  
char* piece_b = { "▒Nдhдh╢H╢Hиоио░и░ие]е]иЄиЄиЄиЄиЄ" };
char* piece_r = { "л╙еKеKм█м█┌╧┌╧╪X╪Xм╢м╢зLзLзLзLзL" };
			   //                      11  13  15  17  19  21  23  25  27  29  31
//"▒Nдhдh╢H╢Hиоио░и░ие]е]иЄиЄиЄиЄиЄл╙еKеKм█м█┌╧┌╧╪X╪Xм╢м╢зLзLзLзLзL"

int piece_pos_b[16][2] = { {9,4},{9,3},{9,5},{9,2},{9,6},{9,0},{9,8},{9,1},{9,9},{7,1},{7,7},{6,0},{6,2},{6,4},{6,6},{6,8} };
int piece_pos_r[16][2] = { {0,4},{0,3},{0,5},{0,2},{0,6},{0,0},{0,8},{0,1},{0,9},{2,1},{2,7},{3,0},{3,2},{3,4},{3,6},{3,8} };

char* board_default[25] = {
	//б@б@ впб@в░б@в▒б@в▓б@в│б@в┤б@в╡б@в╢б@в╖
	"∙▌∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙▀\n",//0
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@░_∙°\n",//1
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",//2
	"∙°б@б@┌╧вw╪Xвwм█вwеKвwл╙вwеKвwм█вw╪Xвw┌╧б@дт∙°\n",//0   //9*10
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@╡L∙°\n",//1
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwм╢вwвqвwвqвwвqвwвqвwвqвwм╢вwвtб@ом∙°\n",//2
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@зLвwвqвwзLвwвqвwзLвwвqвwзLвwвqвwзLб@дj∙°\n",//3
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╞[б@вuвwвrвwвrвwвrвwвrвwвrвwвrвwвrвwвtб@дV∙°\n",//4
	"∙°б@б@вxб@б@╖бб@кeб@б@б@б@б@║~б@м╔б@б@вxб@б@∙°\n",
	"∙°┤╤б@вuвwвsвwвsвwвsвwвsвwвsвwвsвwвsвwвtб@д╥∙°\n",//5
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°дгб@иЄвwвqвwиЄвwвqвwиЄвwвqвwиЄвwвqвwиЄб@б@∙°\n",//6
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╗yб@вuвwе]вwвqвwвqвwвqвwвqвwвqвwе]вwвtб@б@∙°\n",//7
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°пuб@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@б@∙°\n",//8
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°зgб@иовw░ивw╢Hвwдhвw▒Nвwдhвw╢Hвw░ивwиоб@б@∙°\n",//9
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°дlб@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙у∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙х\n",

};


char* board_empty[25] = {
	"∙▌∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙▀\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@░_∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°б@б@вzвwвwвwвwвwвwвwвwвwвwвwвwвwвwвwв{б@дт∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@╡L∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@вuвw∙свwвqвwвqвwвqвwвqвwвqвw∙свwвtб@ом∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°б@б@∙рвwвqвw∙свwвqвw∙свwвqвw∙свwвqвw∙тб@дj∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╞[б@вuвwвrвwвrвwвrвwвrвwвrвwвrвwвrвwвtб@дV∙°\n",
	"∙°б@б@вxб@б@╖бб@кeб@б@б@б@б@║~б@м╔б@б@вxб@б@∙°\n",
	"∙°┤╤б@вuвwвsвwвsвwвsвwвsвwвsвwвsвwвsвwвtб@д╥∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°дгб@∙рвwвqвw∙свwвqвw∙свwвqвw∙свwвqвw∙тб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@вxб@б@∙°\n",
	"∙°╗yб@вuвw∙свwвqвwвqвwвqвwвqвwвqвw∙свwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвнвxвмвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°пuб@вuвwвqвwвqвwвqвwвqвwвqвwвqвwвqвwвtб@б@∙°\n",
	"∙°б@б@вxб@вxб@вxб@вxвмвxвнвxб@вxб@вxб@вxб@б@∙°\n",
	"∙°зgб@в|вwвwвwвwвwвwвwвwвwвwвwвwвwвwвwв}б@б@∙°\n",
	"∙°б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙°дlб@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@б@∙°\n",
	"∙у∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙х\n",

};
