#include "piece.h"


char getPiece_b(int i) {

	char* piece_b = { "±N¤h¤h¶H¶H¨®¨®°¨°¨¥]¥]¨ò¨ò¨ò¨ò¨ò" };
	
	return piece_b[i];

}
char getPiece_r(int i) {

	char* piece_r = { "«Ó¥K¥K¬Û¬ÛÚÏÚÏØXØX¬¶¬¶§L§L§L§L§L" };

	return piece_r[i];
}
void  getPiece_pos_b(POS* p) {

	POS pos[16] = { { 9,4 },{ 9,3 },{ 9,5 },{ 9,2 },{ 9,6 },{ 9,0 },{ 9,8 },{ 9,1 },{ 9,9 },{ 7,1 },{ 7,7 },{ 6,0 },{ 6,2 },{ 6,4 },{ 6,6 },{ 6,8 } };

	for (int i = 0; i < 16; i++)
		p[i] = pos[16];
}
void getPiece_pos_r(POS* p) {

	POS pos[16] = { { 0,4 },{ 0,3 },{ 0,5 },{ 0,2 },{ 0,6 },{ 0,0 },{ 0,8 },{ 0,1 },{ 0,9 },{ 2,1 },{ 2,7 },{ 3,0 },{ 3,2 },{ 3,4 },{ 3,6 },{ 3,8 } };

	for (int i = 0; i < 16; i++)
		p[i] = pos[16];
	return pos;
}

void getPiece_board_default(char** str)
{
	char* temp[25] = {
		//¡@¡@ ¢¯¡@¢°¡@¢±¡@¢²¡@¢³¡@¢´¡@¢µ¡@¢¶¡@¢·
		"ùÝùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùß\n",//0
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@°_ùø\n",//1
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",//2
		"ùø¡@¡@ÚÏ¢wØX¢w¬Û¢w¥K¢w«Ó¢w¥K¢w¬Û¢wØX¢wÚÏ¡@¤âùø\n",//0   //9*10
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢­¢x¢¬¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@¢u¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢t¡@µLùø\n",//1
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢¬¢x¢­¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@¢u¢w¬¶¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¬¶¢w¢t¡@®¬ùø\n",//2
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@§L¢w¢q¢w§L¢w¢q¢w§L¢w¢q¢w§L¢w¢q¢w§L¡@¤jùø\n",//3
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùøÆ[¡@¢u¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢t¡@¤Vùø\n",//4
		"ùø¡@¡@¢x¡@¡@·¡¡@ªe¡@¡@¡@¡@¡@º~¡@¬É¡@¡@¢x¡@¡@ùø\n",
		"ùø´Ñ¡@¢u¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢t¡@¤Òùø\n",//5
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¤£¡@¨ò¢w¢q¢w¨ò¢w¢q¢w¨ò¢w¢q¢w¨ò¢w¢q¢w¨ò¡@¡@ùø\n",//6
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø»y¡@¢u¢w¥]¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¥]¢w¢t¡@¡@ùø\n",//7
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢­¢x¢¬¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¯u¡@¢u¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢t¡@¡@ùø\n",//8
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢¬¢x¢­¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø§g¡@¨®¢w°¨¢w¶H¢w¤h¢w±N¢w¤h¢w¶H¢w°¨¢w¨®¡@¡@ùø\n",//9
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",
		"ùø¤l¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",
		"ùãùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùå\n",

	};

	for (int i = 0; i < 25; i++)
		for (int j = 0; j < 48; j++)
			str[i][j] = temp[i][j];
}

void getPiece_board_empty(char** str)
{
	char* temp[25] = {
		"ùÝùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùß\n",
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@°_ùø\n",
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",
		"ùø¡@¡@¢z¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢{¡@¤âùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢­¢x¢¬¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@¢u¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢t¡@µLùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢¬¢x¢­¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@¢u¢wùá¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢wùá¢w¢t¡@®¬ùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¡@¡@ùà¢w¢q¢wùá¢w¢q¢wùá¢w¢q¢wùá¢w¢q¢wùâ¡@¤jùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùøÆ[¡@¢u¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢r¢w¢t¡@¤Vùø\n",
		"ùø¡@¡@¢x¡@¡@·¡¡@ªe¡@¡@¡@¡@¡@º~¡@¬É¡@¡@¢x¡@¡@ùø\n",
		"ùø´Ñ¡@¢u¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢s¢w¢t¡@¤Òùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¤£¡@ùà¢w¢q¢wùá¢w¢q¢wùá¢w¢q¢wùá¢w¢q¢wùâ¡@¡@ùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø»y¡@¢u¢wùá¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢wùá¢w¢t¡@¡@ùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢­¢x¢¬¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø¯u¡@¢u¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢q¢w¢t¡@¡@ùø\n",
		"ùø¡@¡@¢x¡@¢x¡@¢x¡@¢x¢¬¢x¢­¢x¡@¢x¡@¢x¡@¢x¡@¡@ùø\n",
		"ùø§g¡@¢|¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢}¡@¡@ùø\n",
		"ùø¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",
		"ùø¤l¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@ùø\n",
		"ùãùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùùå\n",

	};

	for (int i = 0; i < 25; i++)
		for (int j = 0; j < 48; j++)
			str[i][j] = temp[i][j];


}
